app/controllers/api/events_controller.rb

    def index
        if params.has_key?(:author_id)
            # @events = Event.where(author_id: params[:author_id])
            @events = current_user.events
        else
            @events = Event.all
---
SELECT "events".* FROM "events"

    def show
        @user = User.find_by(id: params[:id])
        @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def update
        # debugger
        @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def destroy
        @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]