app/models/user.rb

    def reset_session_token!
        self.session_token =User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "nseRl2sQ-Bw5aRLeCLQE9w"], ["updated_at", "2021-05-17 15:33:39.473806"], ["id", 3]]